#include <stdio.h>//stdio.h라는 라이브러리 입력합니다

int main()/* 메인 함수의 시작을 나타냅니다*/ 
{
    printf("[마그라테아] ❤❤ 프로젝트 멤버 소개 ❤❤\n");//멤버 소개를 printf로 출력합니다
    printf("=====================================================================\n");// 밑줄을 출력합니다
    
    // 아서 덴트 정보
    printf("이름 | 아서 덴트\t\t성별 | 남\n");//이스케이프 시퀀스 \t를 사용해서 뛰어쓰기를 합니다.
    printf("전공 | 기계 공학\t\t경력 | 0000000000001111 (15)년\n");//이스케이프 시퀀스 \t를 사용해서 뛰어쓰기 한다. 그리고 \n를 통해서 줄을 바꿉니다. 이 진수로 경력 나타냅니다.
    printf("역할 | 아키텍트\t\t기술 | C/C++, 자바, 스프링, 파이썬, 머신러닝/딥러닝\n");//역할을 printf를 통해서 출력합니다.
    printf("---------------------------------------------------------------------\n");//줄을 출력합니다.
    printf("소개 | 실리콘 밸리에서 SNS, 핀테크, HR, 미디어 등의 다양한 프로젝트에 참여하며 경력을 쌓았습니다.\n");//아서 덴트의 소개를 출력합니다 
    printf("      성공과 실패를 겪으며 얻게 된 깨달음을 여러분과 나누고 싶습니다.\n");// 소개 출력, \n 통해서 줄을 바꿉니다.
    printf("=====================================================================\n");// 밑줄 출력합니다
    
    // 김영진 정보
    printf("이름 | 김영진\t\t성별 | 남\n");// 김영진 이라는 이름 출력합니다.
    printf("전공 | 컴퓨터 공학\t\t경력 | 0000000000000010 (2)년\n");//김영진의 전공 출력, 경력을 이진수로 출력합니다 
    printf("역할 | 개발자\t\t기술 | C#, 파이썬, 자바스크립트, 리액트, 코틀린\n");//역할 및 기술 출력합니다.
    printf("---------------------------------------------------------------------\n");//밑줄 출력합니다.
    printf("소개 | 최근에 MAUI 프레임워크로 진행한 개인 자산 관리 프로젝트에서 소프트웨어 개발에 엄청난 매력을 느꼈습니다.\n");//김영진의 소개 출력합니다.
    printf("      나의 코드로 현실의 문제를 해결한다니! 마그라테아를 성공적으로 개발하는 것은 저의 버킷 리스트 중 하나가 되었습니다.\n");//소개 출력합니다.
    printf("=====================================================================\n");// 밑줄을 출력합니다.

    // 임원철 정보
    printf("이름 | 임원철\t\t성별 | 남\n");//임원철이라는 이름 및 성별을 출력합니다.
    printf("전공 | 전자 공학\t\t경력 | 0000000000000001 (1)년\n");//임원철의 전공 및 경력 출력, 경력은 이진수로 바꾸어서 출력합니다.
    printf("역할 | DBA\t\t\t기술 | 자바, PHP, Mongo DB, MS SQL, MySQL\n");//임원철의 역할 출력합니다.
    printf("---------------------------------------------------------------------\n");// 밑줄 출력합니다.
    printf("소개 | 애플리케이션은 결국 데이터를 다루는 방식을 구현한 것이라고 생각합니다.\n");//임원철의 소개 출력합니다.
    printf("      대학에서 컴퓨터 공학과의 빅데이터 과목을 수강하며 데이터 플랫폼에 관해 매력을 느꼈습니다.\n");//임원철의 소개 출력합니다.
    printf("      이번 프로젝트의 성공 여부는 데이터에 달렸다고 생각합니다.\n");// 임원철의 소개 출력합니다.
    printf("      마그라테아에서 다룰 데이터를 생각하면 벌써 부터 흥분됩니다.\n");// 임원철의 소개 출력합니다.
    printf("=====================================================================\n");//밑줄 출력합니다.

    // 유고은 정보
    printf("이름 | 유고은\t\t성별 | 여\n");// 유고은 의 이름 및 성별을 출력합니다.
    printf("전공 | 경영 정보\t\t경력 | 0000000000000001 (1)년\n");// 유고은의 전공 및 경력을 출력함, 경력은 이진수로 바꾸어서 출력합니다.
    printf("역할 | 클라우드\t\t기술 | 자바, PowerShell, Azure, AWS, GCP\n");// 유고은의 역할을 출력합니다.
    printf("---------------------------------------------------------------------\n");//밑줄을 출력합니다.
    printf("소개 | 김영진님과 함께 프로젝트를 진행했으며 클라우드 아키텍처 구현을 담당했습니다.\n");// 유고은의 소개를 출력합니다.
    printf("      학창시절 클라우드에 매력을 느껴 마이크로소프트 Azure에 빠져들었는데,\n");// 유고은의 소개를 출력합니다.
    printf("      깊이 탐구하다보니 다른 퍼블릭 클라우드도 어렵지 않게 이해할 수 있었습니다.\n");// 유고은의 소개를 출력합니다.
    printf("      마그라테아의 클라우드 아키텍처를 내 손으로 꼭 완성시키고 싶습니다.\n");// 유고은의 소개를 출력합니다.
    printf("=====================================================================\n");// 밑줄을 출력합니다.

    // 서혜경 정보
    printf("이름 | 서혜경\t\t성별 | 여\n");// 서해경의 이름 및 성별을 출력합니다.
    printf("전공 | 정치외교\t\t경력 | 0000000000000000 ( 0)년\n");// 서해경의 경력 및 전공을 출력을 합니다. 경력을 이진수로 바꾸어서 출력합니다.
    printf("역할 | 개발자\t\t기술 | 파이썬, 스위프트, 코틀린, Node.js, 피그마\n");// 서해경의 역할을 출력합니다.
    printf("---------------------------------------------------------------------\n");// 밑줄을 출력합니다.
    printf("소개 | 학부과정에서 과제로 프로젝트는 많이 진행해봤지만,\n");//서해경의 소개를 출력합니다.
    printf("      기업의 사활이 걸린 실전 프로젝트는 제 인생의 첫 경험입니다.\n");//서해경의 소개를 출력합니다.
    printf("      이 프로젝트에 참여하게 되어 기대도 많이 되는 한편으로,\n");//서해경의 소개를 출력합니다.
    printf("      제가 잘할 수 있을까 염려가 되기도 합니다.\n");//서해경의 소개를 출력합니다.
    printf("      마그라테아 프로젝트에 관해 들었을 때 제 속에서 이 프로젝트는 인생을 걸고 싶다는 생각을 했습니다.\n");//서해경의 소개를 출력합니다.
    printf("      링크드인을 통해 이미 아서님의 명성을 접했던 터라,\n");//서해경의 소개를 출력합니다.
    printf("      이번 프로젝트에 함께할 수 있어서 영광입니다.\n");//서해경의 소개를 출력합니다.
    printf("=====================================================================\n");//밑줄을 출력합니다.

    return 0;// 반환값을 0으로 함으로써 코드의 마무리를 뜻함
}
